# Essential Functionalities in Pandas

## Author: Sheikh Irfan Ullah Khan

### Contact Me: shirfan.math@gmail.com

#### 1. How to `Reindex` Pandas Objects

In [1]:
import pandas as pd
import numpy as np

In [2]:
obj = pd.Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])
obj

d    4
b    7
a   -5
c    3
dtype: int64

In [3]:
obj1 = obj.reindex(index=['a', 'b', 'c', 'd'])
obj1

a   -5
b    7
c    3
d    4
dtype: int64

In [4]:
obj2 = obj.reindex(index=['a', 'b', 'c', 'd', 'e'])
obj2

a   -5.0
b    7.0
c    3.0
d    4.0
e    NaN
dtype: float64

In [5]:
obj3 = pd.Series([1, 2, 3], index=[0, 1, 2])
obj3

0    1
1    2
2    3
dtype: int64

In [6]:
obj3.reindex(index = np.arange(5))

0    1.0
1    2.0
2    3.0
3    NaN
4    NaN
dtype: float64

In [7]:
obj3.reindex(index = np.arange(5), method='ffill')

0    1
1    2
2    3
3    3
4    3
dtype: int64

In [8]:
# Create a data frame of 3 rows and 3 columns using numpy
obj4 = pd.DataFrame(np.array([[1, 2, 3], [4, 5, 6], [7, 8, 9]]),
                    index = list('cab'),
                    columns = ['Abbottabd', 'Mansehra', 'Haripur'])
obj4

   Abbottabd  Mansehra  Haripur
c          1         2        3
a          4         5        6
b          7         8        9

In [9]:
# Or create a data frame of 3 rows and 3 columns using numpy
obj5 = pd.DataFrame(np.arange(9).reshape((3, 3)),
                  index=['a', 'b', 'c'],
                  columns=['Abbottabd', 'Mansehra', 'Haripur'])
obj5

   Abbottabd  Mansehra  Haripur
a          0         1        2
b          3         4        5
c          6         7        8

In [10]:
obj6 = obj4.reindex(['a', 'b', 'c', 'd'])
obj6

   Abbottabd  Mansehra  Haripur
a        4.0       5.0      6.0
b        7.0       8.0      9.0
c        1.0       2.0      3.0
d        NaN       NaN      NaN

In [11]:
capitals = ['Dera', 'Abbottabd', 'Mansehra', 'Haripur']
print(obj4)
obj4.reindex(columns=capitals)

   Abbottabd  Mansehra  Haripur
c          1         2        3
a          4         5        6
b          7         8        9

   Dera  Abbottabd  Mansehra  Haripur
c   NaN          1         2        3
a   NaN          4         5        6
b   NaN          7         8        9

---
#### 2. How to `Drop` Entries from an Axis

In [12]:
# Create a series
s = pd.Series(np.arange(5), index=['a', 'b', 'c', 'd', 'e'])
s

a    0
b    1
c    2
d    3
e    4
dtype: int32

In [13]:
s.drop('a')

b    1
c    2
d    3
e    4
dtype: int32

In [14]:
ns = s.drop('a')
ns

b    1
c    2
d    3
e    4
dtype: int32

In [15]:
s.drop(['a', 'e'])

b    1
c    2
d    3
dtype: int32

In [16]:
# Create a data frame of 4 rows and 4 columns using numpy
df = pd.DataFrame(np.arange(16).reshape((4, 4)),
                  index=['a', 'b', 'd', 'e'],
                  columns=['Abbottabd', 'Mansehra', 'Haripur', 'Dera'])
df

   Abbottabd  Mansehra  Haripur  Dera
a          0         1        2     3
b          4         5        6     7
d          8         9       10    11
e         12        13       14    15

In [17]:
df.drop(['a', 'e']) # By default axis=0

   Abbottabd  Mansehra  Haripur  Dera
b          4         5        6     7
d          8         9       10    11

In [18]:
df.drop('Dera', axis = 1) # To rmove column we mention the axis = 1

   Abbottabd  Mansehra  Haripur
a          0         1        2
b          4         5        6
d          8         9       10
e         12        13       14

In [19]:
df.drop(['Haripur', 'Dera'], axis = 1)

   Abbottabd  Mansehra
a          0         1
b          4         5
d          8         9
e         12        13

In [20]:
# Here we can recover the data frame in original form
df

   Abbottabd  Mansehra  Haripur  Dera
a          0         1        2     3
b          4         5        6     7
d          8         9       10    11
e         12        13       14    15

In [21]:
df.drop(['Haripur', 'Dera'], axis = 1, inplace = True)

In [22]:
# Setting inplace = True will change the original data frame
df

   Abbottabd  Mansehra
a          0         1
b          4         5
d          8         9
e         12        13

In [23]:
# Or create a data frame of 4 rows and 4 columns using numpy randomly
df1 = pd.DataFrame(np.random.randint(0, 100, size=(4, 4)),
                   index=['a', 'b', 'd', 'e'],
                   columns=['Abbottabd', 'Mansehra', 'Haripur', 'Dera'])
df1

   Abbottabd  Mansehra  Haripur  Dera
a         81        24       89    47
b          7        84       20    19
d         99        90       75    37
e         61        81       69    56